#include <iostream>
using namespace std;

// 先手必胜状态：可以走到某一个必败状态
// 先手必败状态：走不到任何一个必败状态

// 证明1：若a_1 ^ a_2 ^ ... ^ a_n != 0，那么一定可以找到一种情况，操作完后式子=0
// a_1 ^ a_2 ^ ... ^ a_n = x (x!=0)，找x最高位1所在的位置k，然后在a_1~a_n中找a_i以满足其第k位是1，
// 然后得a_i' = a_i ^ x（a_i'一定小于a_i），这样后手在进行异或时一定为0，先手必胜（全0局面一定被后手拿到）
//   1. 0 ^ 0 ^ ... ^ 0 = 0
//   2. a_1 ^ a_2 ^ ... ^ a_n = x
//   3. a_1 ^ a_2 ^ ... ^ a_i' ^ a_n = x ^ x = 0 (a_i' = a_i ^ x, x = a_i - a_i ^ x)

// 证明2：若a_1 ^ a_2 ^ ... ^ a_n = 0，那么对于所有操作，操作完后一定式子!=0
// 反证，若对原式a_i操作（a_i -> a_i'），
//   1. a_1 ^ a_2 ^ ... a_i ^ a_{i+1} ^ ... ^ a_n = 0
//   2. a_1 ^ a_2 ^ ... a_i' ^ a_{i+1} ^ ... ^ a_n = 0
//   1,2联立 => a_i ^ a_i' = 0 => a_i = a_i'，矛盾（不能不拿）
int main() {
  int n;
  cin >> n;

  int res = 0;
  while (n -- ) {
    int x;
    scanf("%d", &x);
    res ^= x;
  }

  if (res) puts("Yes");
  else puts("No");
  return 0;
}